Repository: sunpebble/fresh-pantry
Catalog: apps/ios/FreshPantry/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, fr, ja

# app.invite.acknowledge
source: 知道了
en: Got it
fr: Compris
ja: 了解しました

# app.invite.promptSignIn
source: 收到家庭邀请,请先在「设置 → 家庭共享」登录,登录后会自动继续处理。
en: You have a family invite. Sign in under Settings → Family Sharing first — it will resume automatically after you sign in.
fr: Vous avez reçu une invitation familiale. Connectez-vous d'abord dans Réglages → Partage familial — le traitement continuera automatiquement après la connexion.
ja: 家族への招待が届いています。まず「設定 → 家族共有」でログインしてください。ログイン後、自動的に処理が続行されます。

# app.invite.title
source: 家庭邀请
en: Family invite
fr: Invitation familiale
ja: 家族への招待

# app.invite.unsupported
source: 此版本未配置后端,无法打开家庭邀请。
en: This build has no backend configured, so the family invite can't be opened.
fr: Cette version n'a pas de backend configuré, l'invitation familiale ne peut donc pas être ouverte.
ja: このビルドにはバックエンドが設定されていないため、家族への招待を開けません。

# auth.account.title
source: 账号
en: Account
fr: Compte
ja: アカウント

# auth.button.sendCode
source: 发送验证码
en: Send code
fr: Envoyer le code
ja: 認証コードを送信

# auth.button.sending
source: 发送中…
en: Sending...
fr: Envoi...
ja: 送信中…

# auth.button.signOut
source: 退出登录
en: Sign out
fr: Se déconnecter
ja: ログアウト

# auth.button.signingOut
source: 退出中…
en: Signing out...
fr: Déconnexion...
ja: ログアウト中…

# auth.button.verify
source: 验证登录
en: Verify and sign in
fr: Valider la connexion
ja: 確認してログイン

# auth.button.verifying
source: 验证中…
en: Verifying...
fr: Validation...
ja: 確認中…

# auth.code.label
source: 验证码
en: Verification code
fr: Code de vérification
ja: 認証コード

# auth.code.placeholder
source: 6 位数字
en: 6 digits
fr: 6 chiffres
ja: 6桁の数字

# auth.code.resend
source: 重新发送验证码
en: Resend code
fr: Renvoyer le code
ja: 認証コードを再送信

# auth.code.resendAfter %lld
source: %lld 秒后可重新发送
en: Resend in %lld sec
fr: Renvoyer dans %lld s
ja: %lld秒後に再送信

# auth.code.sent %@
source: 验证码已发送至 %@
en: Code sent to %@
fr: Code envoyé à %@
ja: %@ に認証コードを送信しました

# auth.currentAccount
source: 当前账号
en: Current account
fr: Compte actuel
ja: 現在のアカウント

# auth.email.label
source: 邮箱
en: Email
fr: E-mail
ja: メール

# auth.error.emptyCode
source: 请输入验证码
en: Enter the verification code
fr: Saisissez le code de vérification
ja: 認証コードを入力してください

# auth.error.generic
source: 操作失败,请稍后重试
en: Something went wrong. Try again later.
fr: L'opération a échoué. Réessayez plus tard.
ja: 操作に失敗しました。しばらくしてからもう一度お試しください。

# auth.error.invalidEmail
source: 请输入有效的邮箱地址
en: Enter a valid email address
fr: Saisissez une adresse e-mail valide
ja: 有効なメールアドレスを入力してください

# auth.error.invalidOtp
source: 验证码不正确,请重新输入
en: The code is incorrect. Try again.
fr: Le code est incorrect. Réessayez.
ja: 認証コードが正しくありません。もう一度入力してください。

# auth.error.network
source: 网络连接失败,请检查网络后重试
en: Network connection failed. Check your connection and try again.
fr: La connexion réseau a échoué. Vérifiez votre connexion et réessayez.
ja: ネットワーク接続に失敗しました。接続を確認してもう一度お試しください。

# auth.error.otpExpired
source: 验证码已失效,请重新获取
en: The code has expired. Request a new one.
fr: Le code a expiré. Demandez-en un nouveau.
ja: 認証コードの有効期限が切れました。再取得してください。

# auth.error.rateLimit
source: 请求过于频繁,请稍后再试
en: Too many requests. Try again later.
fr: Trop de demandes. Réessayez plus tard.
ja: リクエストが多すぎます。しばらくしてからお試しください。

# auth.header.codeSent.subtitle
source: 我们已向你的邮箱发送了 6 位验证码。
en: We sent a 6-digit code to your email.
fr: Nous avons envoyé un code à 6 chiffres à votre adresse e-mail.
ja: 6桁の認証コードをメールに送信しました。

# auth.header.local.subtitle
source: 未配置后端,当前为本地模式。数据仅保存在本机。
en: No backend is configured. Data stays on this device.
fr: Aucun backend n'est configuré. Les données restent sur cet appareil.
ja: バックエンド未設定のためローカルモードです。データはこの端末だけに保存されます。

# auth.header.local.title
source: 本地模式
en: Local mode
fr: Mode local
ja: ローカルモード

# auth.header.login.subtitle
source: 输入邮箱获取验证码,无需密码。
en: Enter your email to get a code. No password needed.
fr: Saisissez votre e-mail pour recevoir un code. Aucun mot de passe requis.
ja: メールアドレスを入力して認証コードを受け取ります。パスワードは不要です。

# auth.header.login.title
source: 登录 Fresh Pantry
en: Sign in to Fresh Pantry
fr: Connexion à Fresh Pantry
ja: Fresh Pantryにログイン

# auth.header.signedIn.subtitle
source: 登录后即可在家庭成员间同步库存与采购。
en: Your pantry and shopping list can sync with household members.
fr: Votre stock et vos courses peuvent se synchroniser avec les membres du foyer.
ja: 在庫と買い物リストを家族メンバーと同期できます。

# auth.header.signedIn.title
source: 已登录
en: Signed in
fr: Connecté
ja: ログイン済み

# auth.local.card.message
source: 此版本未配置 Supabase 后端,无法登录。库存、采购与食谱仍可在本机正常使用。
en: This build has no Supabase backend, so sign-in is disabled. Pantry, shopping, and recipes still work locally.
fr: Cette version n'a pas de backend Supabase, la connexion est donc désactivée. Le stock, les courses et les recettes fonctionnent toujours localement.
ja: このビルドにはSupabaseバックエンドがないためログインできません。在庫、買い物、レシピは端末内で利用できます。

# auth.local.card.title
source: 登录已禁用
en: Sign-in disabled
fr: Connexion désactivée
ja: ログインは無効です

# backup.error.invalidFile
source: 备份文件无效
en: This backup file isn't valid.
fr: Ce fichier de sauvegarde n'est pas valide.
ja: バックアップファイルが無効です

# backup.error.unsupportedVersion
source: 不支持的备份版本
en: This backup version isn't supported.
fr: Cette version de sauvegarde n'est pas prise en charge.
ja: このバックアップのバージョンには対応していません

# backup.export.action.subtitle
source: 生成 JSON 备份文件
en: Generate a JSON backup file
fr: Générer un fichier de sauvegarde JSON
ja: JSONバックアップファイルを作成します

# backup.export.action.title
source: 导出备份
en: Export backup
fr: Exporter la sauvegarde
ja: バックアップをエクスポート

# backup.export.copy.subtitle
source: 复制备份 JSON，可粘贴到备忘录/邮件保存
en: Copy the backup JSON, then paste it into Notes or an email to keep it
fr: Copiez le JSON de sauvegarde, puis collez-le dans Notes ou un e-mail pour le conserver
ja: バックアップのJSONをコピーし、メモやメールに貼り付けて保存できます

# backup.export.copy.title
source: 复制到剪贴板
en: Copy to clipboard
fr: Copier dans le presse-papiers
ja: クリップボードにコピー

# backup.export.copySuccess %lld
source: 已复制 %lld 字节，粘贴到备忘录/邮件即可保存
en: Copied %lld bytes. Paste it into Notes or an email to keep it.
fr: %lld octets copiés. Collez-les dans Notes ou un e-mail pour les conserver.
ja: %lldバイトをコピーしました。メモやメールに貼り付けて保存できます

# backup.export.failure
source: 导出失败，请重试
en: Export failed. Please try again.
fr: Échec de l'exportation. Veuillez réessayer.
ja: エクスポートに失敗しました。もう一度お試しください。

# backup.export.footer
source: 备份包含库存、采购清单、自建食谱、膳食计划、食材去向记录、菜谱收藏、饮食偏好与忌口、提醒设置与 AI 配置；不含外观设置与可重建的食材详情缓存。
en: The backup includes inventory, shopping list, custom recipes, meal plans, ingredient-usage history, recipe favorites, dietary preferences and exclusions, reminder settings, and AI configuration. It excludes appearance settings and the rebuildable ingredient-detail cache.
fr: La sauvegarde comprend le stock, la liste de courses, les recettes personnalisées, les plans de repas, l'historique d'utilisation des ingrédients, les recettes favorites, les préférences et exclusions alimentaires, les réglages de rappel et la configuration IA. Elle exclut les réglages d'apparence et le cache des détails d'ingrédients (reconstructible).
ja: バックアップには在庫、買い物リスト、自作レシピ、献立プラン、食材の消費履歴、お気に入りレシピ、食事の好みと禁忌食材、リマインダー設定、AI設定が含まれます。外観設定と再構築可能な食材詳細キャッシュは含まれません。

# backup.export.header
source: 导出
en: Export
fr: Exporter
ja: エクスポート

# backup.export.share.title
source: 分享备份文件
en: Share backup file
fr: Partager le fichier de sauvegarde
ja: バックアップファイルを共有

# backup.import.clipboardEmpty
source: 剪贴板为空，请先复制备份 JSON
en: Clipboard is empty. Copy the backup JSON first.
fr: Le presse-papiers est vide. Copiez d'abord le JSON de sauvegarde.
ja: クリップボードが空です。先にバックアップのJSONをコピーしてください

# backup.import.failure
source: 导入失败，请重试
en: Import failed. Please try again.
fr: Échec de l'importation. Veuillez réessayer.
ja: インポートに失敗しました。もう一度お試しください。

# backup.import.file.subtitle
source: 从 JSON 备份文件恢复数据
en: Restore data from a JSON backup file
fr: Restaurer les données à partir d'un fichier de sauvegarde JSON
ja: JSONバックアップファイルからデータを復元します

# backup.import.file.title
source: 导入备份
en: Import backup
fr: Importer une sauvegarde
ja: バックアップをインポート

# backup.import.footer
source: 导入会覆盖本机当前数据。无效或版本不支持的文件会被拒绝，不会破坏现有数据。
en: Importing overwrites your current data on this device. Invalid or unsupported files are rejected without touching your existing data.
fr: L'importation remplace les données actuelles de cet appareil. Les fichiers invalides ou dont la version n'est pas prise en charge sont rejetés sans toucher à vos données existantes.
ja: インポートすると、この端末の現在のデータが上書きされます。無効なファイルや対応していないバージョンは拒否され、既存データは変更されません。

# backup.import.header
source: 导入
en: Import
fr: Importer
ja: インポート

# backup.import.paste.subtitle
source: 从复制的 JSON 文本恢复数据
en: Restore data from copied JSON text
fr: Restaurer les données à partir du texte JSON copié
ja: コピーしたJSONテキストからデータを復元します

# backup.import.paste.title
source: 从剪贴板导入
en: Import from clipboard
fr: Importer depuis le presse-papiers
ja: クリップボードからインポート

# backup.import.readFailure
source: 无法读取所选文件
en: Couldn't read the selected file.
fr: Impossible de lire le fichier sélectionné.
ja: 選択したファイルを読み込めませんでした

# backup.import.success
source: 已导入
en: Import complete
fr: Importation terminée
ja: インポートが完了しました

# backup.importConfirm.cancel
source: 取消
en: Cancel
fr: Annuler
ja: キャンセル

# backup.importConfirm.confirm
source: 导入
en: Import
fr: Importer
ja: インポート

# backup.importConfirm.householdNote
source: 已加入家庭：导入的数据也会同步到其他成员。
en: You're in a shared household: the imported data will also sync to other members.
fr: Vous faites partie d'une famille partagée : les données importées seront aussi synchronisées avec les autres membres.
ja: 家庭に参加中です。インポートしたデータは他のメンバーにも同期されます。

# backup.importConfirm.message
source: 导入会覆盖本机当前数据，此操作无法撤销。
en: Importing overwrites your current data on this device. This can't be undone.
fr: L'importation remplace les données actuelles de cet appareil. Cette action est irréversible.
ja: インポートすると、この端末の現在のデータが上書きされます。この操作は元に戻せません。

# backup.importConfirm.title
source: 确认导入？
en: Import backup?
fr: Importer la sauvegarde ?
ja: インポートしますか？

# backup.title
source: 数据备份
en: Backup
fr: Sauvegarde
ja: データバックアップ

# component.action.done
source: 完成
en: Done
fr: Terminé
ja: 完了

# component.intakeAction.merge
source: 合并
en: Merge
fr: Fusionner
ja: 統合

# component.intakeAction.mergeInto %@
source: 合并 → %@
en: Merge → %@
fr: Fusionner → %@
ja: 統合 → %@

# component.intakeAction.newBatch
source: 新建 Batch
en: New batch
fr: Nouveau lot
ja: 新規バッチ

# component.recipeCard.allMatched
source: 食材齐全
en: All ingredients on hand
fr: Tous les ingrédients sont disponibles
ja: 食材はすべて揃っています

# component.recipeCard.cookCount %lld
source: 做过 %lld 次
en: Cooked %lld times
fr: Cuisiné %lld fois
ja: %lld回作った

# component.recipeCard.expiringUse %lld
source: 临期 · %lld
en: Expiring · %lld
fr: Expire · %lld
ja: 期限間近 ・ %lld

# component.recipeCard.favorite
source: 收藏
en: Add to favorites
fr: Ajouter aux favoris
ja: お気に入りに追加

# component.recipeCard.matchProgress %lld %lld %lld
source: 已有 %lld/%lld · 缺 %lld 件
en: Have %1$lld/%2$lld · missing %lld items
fr: %lld/%2$lld disponibles · %lld manquants
ja: %lld/%lld あり ・ %lld個不足

# component.recipeCard.minutes %lld
source: %lld 分钟
en: %lld minutes
fr: %lld minutes
ja: %lld分

# component.recipeCard.unfavorite
source: 取消收藏
en: Remove from favorites
fr: Retirer des favoris
ja: お気に入りを解除

# component.search.clear
source: 清空搜索
en: Clear search
fr: Effacer la recherche
ja: 検索をクリア

# component.search.placeholder
source: 搜索食材
en: Search ingredients
fr: Rechercher des ingrédients
ja: 食材を検索

# component.status.expired
source: 已过期
en: Expired
fr: Expiré
ja: 期限切れ

# component.status.fresh
source: 新鲜
en: Fresh
fr: Frais
ja: 新鮮

# component.status.soon
source: 即将过期
en: Use soon
fr: À consommer bientôt
ja: もうすぐ期限切れ

# component.status.urgent
source: 快过期
en: Urgent
fr: Urgent
ja: 期限間近

# component.stepper.decrease %@
source: 减少%@
en: Decrease%@
fr: Diminuer%@
ja: %@を減らす

# component.stepper.increase %@
source: 增加%@
en: Increase%@
fr: Augmenter%@
ja: %@を増やす

# cookStep.label.minutes %lld
source: %lld 分钟
en: %lld min
fr: %lld min
ja: %lld分

# cookStep.label.minutesSeconds %lld %lld
source: %lld 分 %lld 秒
en: %lld min %lld sec
fr: %lld min %lld s

# cookStep.label.seconds %lld
source: %lld 秒
en: %lld sec
fr: %lld s

# dashboard.category.itemCount %@ %lld
source: %@，%lld 件
en: %@, %lld items
fr: %@, %lld articles

# dashboard.category.title
source: 食材分类
en: Categories
fr: Catégories
ja: 食材カテゴリー

# dashboard.clearFridge.constraintPlaceholder
source: 可选要求:清淡 / 15分钟 / 晚餐 / 不要香菜…
en: Optional: light / 15 min / dinner / no cilantro…
fr: Facultatif : léger / 15 min / dîner / sans coriandre…
ja: 任意の条件：あっさり／15分／夕食／パクチー抜きなど

# dashboard.clearFridge.emptyError
source: 暂无临期食材可用于生成。
en: No expiring ingredients to generate from.
fr: Aucun ingrédient expirant disponible pour générer une recette.
ja: 生成に使える期限が近い食材がありません。

# dashboard.clearFridge.generate
source: AI 生成清冰箱食谱
en: Generate with AI
fr: Générer avec l'IA
ja: AIでレシピを生成

# dashboard.clearFridge.generateFailed %@
source: 生成失败：%@
en: Generation failed: %@
fr: Échec de la génération : %@
ja: 生成に失敗しました：%@

# dashboard.clearFridge.generating
source: 生成中…
en: Generating…
fr: Génération en cours…

# dashboard.clearFridge.subtitle
source: 用现有临期食材现场生成一道家常菜，省得到处翻菜谱。
en: Generate a home-style dish from what's expiring right now — no need to hunt for recipes.
fr: Générez un plat maison à partir de ce qui expire maintenant — plus besoin de chercher une recette.
ja: 期限が近い食材から家庭料理をその場で生成。レシピを探し回る必要はありません。

# dashboard.clearFridge.title
source: AI 清冰箱食谱
en: AI clear-the-fridge recipe
fr: Recette IA anti-gaspillage
ja: AIで冷蔵庫一掃レシピ

# dashboard.expiring.actionFailed
source: 操作失败，请重试
en: That didn't go through — try again
fr: L'opération a échoué — veuillez réessayer
ja: 操作に失敗しました。再度お試しください

# dashboard.expiring.addToShopping
source: 加入购物清单
en: Add to shopping list
fr: Ajouter à la liste de courses
ja: 買い物リストに追加

# dashboard.expiring.consumed
source: 用了
en: Used
fr: Utilisé
ja: 使用済み

# dashboard.expiring.consumedUndo %@
source: 已用掉「%@」
en: Used up “%@”
fr: « %@ » marqué comme utilisé
ja: 「%@」を使用済みにしました

# dashboard.expiring.cookThis
source: 做这道菜
en: Cook this
fr: Cuisiner ce plat
ja: この料理を作る

# dashboard.expiring.itemCount %lld
source: %lld 件
en: %lld items
fr: %lld articles

# dashboard.expiring.none
source: 暂无临期
en: Nothing expiring
fr: Rien n'arrive à expiration
ja: 期限が近い食材はありません

# dashboard.expiring.title
source: 临期提醒
en: Expiry reminders
fr: Rappels d'expiration
ja: 期限切れリマインダー

# dashboard.expiring.undo
source: 撤销
en: Undo
fr: Annuler
ja: 取り消す

# dashboard.expiring.viewAll
source: 查看全部
en: View all
fr: Tout afficher
ja: すべて見る

# dashboard.fallback.available %lld
source: 可用 %lld 件
en: %lld items on hand
fr: %lld articles disponibles
ja: %lld件が利用可能

# dashboard.fallback.title
source: 用临期 · 今天就能做
en: Use what's expiring · ready today
fr: Utilisez ce qui expire · prêt aujourd'hui
ja: 期限が近い食材を使う ・ 今日作れます

# dashboard.greeting.afternoon
source: 下午好
en: Good afternoon
fr: Bon après-midi
ja: こんにちは

# dashboard.greeting.chef %@
source: %@，主厨。
en: %@, chef.
fr: %@, chef.
ja: %@、シェフ。

# dashboard.greeting.evening
source: 晚上好
en: Good evening
fr: Bonsoir
ja: こんばんは

# dashboard.greeting.lateNight
source: 夜深了
en: Still up?
fr: Il se fait tard
ja: 夜も遅いですね

# dashboard.greeting.morning
source: 早安
en: Good morning
fr: Bonjour
ja: おはようございます

# dashboard.greeting.noon
source: 午安
en: Good afternoon
fr: Bon après-midi
ja: こんにちは

# dashboard.lowStock.count %lld
source: %lld 项常买缺货
en: %lld frequent items out of stock
fr: %lld articles fréquents en rupture
ja: よく買う%lld件が欠品中

# dashboard.lowStock.sufficient
source: 常买项库存充足
en: Frequent items well stocked
fr: Articles fréquents bien approvisionnés
ja: よく買う食材の在庫は十分です

# dashboard.lowStock.title
source: 库存不足
en: Low stock
fr: Stock faible
ja: 在庫不足

# dashboard.mealPlan.empty
source: 规划这一周吃什么
en: Plan what to eat this week
fr: Planifiez vos repas de la semaine
ja: 今週の食事を計画しましょう

# dashboard.mealPlan.missing %lld
source: 还缺 %lld 样
en: %lld ingredients missing
fr: %lld ingrédients manquants
ja: あと%lld種類不足

# dashboard.mealPlan.title
source: 膳食计划
en: Meal plan
fr: Plan de repas
ja: 食事プラン

# dashboard.mealPlan.upcoming %lld
source: 未来 7 天已排 %lld 顿
en: %lld meals planned in the next 7 days
fr: %lld repas prévus sur 7 jours
ja: 今後7日間に%lld食を予定

# dashboard.mealPlan.upcomingWithToday %lld %lld
source: 未来 7 天已排 %lld 顿 · 今天 %lld 顿
en: %lld meals planned in the next 7 days · %2$lld today
fr: %lld repas prévus sur 7 jours · %2$lld aujourd'hui
ja: 今後7日間に%lld食を予定 ・ 今日は%lld食

# dashboard.recommendation.loading
source: 加载推荐中
en: Loading recommendation
fr: Chargement de la suggestion
ja: おすすめを読み込み中

# dashboard.recommendation.title
source: 今日推荐
en: Today's pick
fr: Suggestion du jour
ja: 今日のおすすめ

# dashboard.reminder.dailySummary %@
source: 每日 %@ 汇总
en: Daily summary at %@
fr: Résumé quotidien à %@
ja: 毎日%@に要約

# dashboard.reminder.enableInSettings
source: 去「设置 › 临期提醒」开启系统通知后送达
en: Turn on system notifications under Settings › Expiry Reminders to receive them
fr: Activez les notifications système dans Réglages › Rappels d'expiration pour les recevoir
ja: 「設定 › 期限切れリマインダー」でシステム通知を有効にすると届きます

# dashboard.reminder.granted
source: 提醒已开启
en: Reminders on
fr: Rappels activés
ja: リマインダーはオンです

# dashboard.reminder.notSet
source: 未设置提醒时机
en: No reminder time set
fr: Aucune heure de rappel définie
ja: リマインダーの時間は未設定です

# dashboard.reminder.offsetDays %@
source: 提前 %@ 天
en: %@ days ahead
fr: %@ jours avant
ja: %@日前

# dashboard.reminder.ungranted
source: 通知未开启
en: Notifications off
fr: Notifications désactivées
ja: 通知はオフです

# dashboard.search
source: 搜索
en: Search
fr: Rechercher
ja: 検索

# dashboard.shopping.addFailed
source: 添加失败，请重试
en: Couldn't add it — try again
fr: Impossible d'ajouter l'article — veuillez réessayer
ja: 追加に失敗しました。再度お試しください

# dashboard.shopping.added %@
source: 已将「%@」加入购物清单
en: Added “%@” to the shopping list
fr: « %@ » a été ajouté à la liste de courses
ja: 「%@」を買い物リストに追加しました

# dashboard.shopping.duplicate %@
source: 「%@」已在购物清单中
en: “%@” is already on the shopping list
fr: « %@ » est déjà dans la liste de courses
ja: 「%@」はすでに買い物リストにあります

# dashboard.shopping.loading
source: 购物清单加载中，请稍后再试
en: Shopping list is still loading — try again shortly
fr: La liste de courses se charge encore — réessayez dans un instant
ja: 買い物リストを読み込み中です。しばらくしてから再度お試しください

# dashboard.shoppingTile.done
source: 清单已全部完成
en: List all done
fr: Liste entièrement terminée
ja: リストはすべて完了しました

# dashboard.shoppingTile.pending %lld
source: 还有 %lld 项待购买
en: %lld items still to buy
fr: %lld articles à acheter
ja: あと%lld件購入が必要

# dashboard.shoppingTile.title
source: 购物清单
en: Shopping list
fr: Liste de courses
ja: 買い物リスト

# dashboard.stat.categories
source: 分类
en: categories
fr: catégories
ja: 分類

# dashboard.stat.expired
source: 已过期
en: Expired
fr: Expiré
ja: 期限切れ

# dashboard.stat.items
source: 件食材
en: items
fr: articles
ja: 件の食材

# dashboard.stat.needsAttention
source: 需处理
en: Needs attention
fr: À surveiller
ja: 対応が必要

# dashboard.stat.sufficient
source: 充足
en: Sufficient
fr: Suffisant
ja: 十分

# dashboard.title
source: 首页
en: Home
fr: Accueil
ja: ホーム

# dashboard.waste.emptyMetric
source: 看看你的食材用掉率
en: See your use-up rate
fr: Découvrez votre taux d'utilisation
ja: 食材の使用率を見てみましょう

# dashboard.waste.rescued %lld
source: 抢救 %lld
en: Rescued %lld
fr: %lld sauvés
ja: %lld件を救出

# dashboard.waste.title
source: 减废统计
en: Waste stats
fr: Statistiques anti-gaspillage
ja: 廃棄削減統計

# dashboard.waste.useUpPercent %lld
source: 本月用掉率 %lld%%
en: %lld%% used up this month
fr: %lld % utilisé ce mois-ci
ja: 今月の使用率 %lld%%

# error.ai.authExpired
source: 登录已过期，请重新登录
en: Your session has expired. Please sign in again.
fr: Session expirée, veuillez vous reconnecter
ja: ログインの有効期限が切れました。再度ログインしてください

# error.ai.authFailed %lld
source: 认证失败 (%lld)
en: Sign-in failed (%lld)
fr: Échec de l'authentification (%lld)
ja: 認証に失敗しました (%lld)

# error.ai.busy
source: 服务繁忙 (429)
en: Service is busy (429)
fr: Service occupé (429)
ja: サービスが混み合っています (429)

# error.ai.cancelled
source: 已取消
en: Cancelled
fr: Annulé
ja: キャンセルしました

# error.ai.emptyResponse
source: 响应中无 content
en: The response contains no content
fr: La réponse ne contient aucun contenu
ja: レスポンスに content がありません

# error.ai.network %@
source: 网络错误：%@
en: Network error: %@
fr: Erreur réseau : %@
ja: ネットワークエラー：%@

# error.ai.notConfigured
source: AI 服务未配置
en: AI service not set up
fr: Service IA non configuré
ja: AIサービスが未設定です

# error.ai.notFound
source: 接口不存在 (404)。Base URL 应填写到 /v1，例如 https://example.com/v1，不要包含 /chat/completions
en: Endpoint not found (404). The base URL should end at /v1, e.g. https://example.com/v1 — do not include /chat/completions
fr: Point d'accès introuvable (404). L'URL de base doit s'arrêter à /v1, p. ex. https://example.com/v1, sans /chat/completions
ja: エンドポイントが見つかりません (404)。Base URL は /v1 まで入力してください（例：https://example.com/v1）。/chat/completions は含めないでください

# error.ai.parse %@
source: 解析响应失败: %@
en: Failed to parse the response: %@
fr: Échec de l'analyse de la réponse : %@
ja: レスポンスの解析に失敗しました: %@

# error.ai.quotaExhausted
source: 今天的 AI 次数用完了，明天再来
en: You've used up today's AI quota. Come back tomorrow!
fr: Quota IA du jour épuisé, revenez demain
ja: 本日のAI利用回数を使い切りました。また明日どうぞ

# error.ai.serverError %lld
source: 服务错误 (%lld)
en: Server error (%lld)
fr: Erreur du serveur (%lld)
ja: サーバーエラー (%lld)

# error.ai.timeout
source: 请求超时
en: Request timed out
fr: Délai de la requête dépassé
ja: リクエストがタイムアウトしました

# error.ai.unexpectedStatus %lld %@
source: 意外状态 (%1$lld)%2$@
en: Unexpected status (%1$lld)%2$@
fr: Statut inattendu (%1$lld)%2$@
ja: 予期しないステータス (%1$lld)%2$@

# error.auth.signInRequired
source: 请先登录后再使用 AI 功能
en: Please sign in before using the AI features.
fr: Veuillez vous connecter avant d'utiliser les fonctionnalités IA.
ja: AI機能を使用するには、先にログインしてください

# error.ingredientParse.emptyImage
source: 图片为空
en: The photo is empty.
fr: La photo est vide.
ja: 画像が空です

# error.ingredientParse.emptyText
source: 文本不能为空
en: The text can't be empty.
fr: Le texte ne peut pas être vide.
ja: テキストを入力してください

# error.ingredientParse.invalidJsonArray
source: AI 返回不是合法 JSON 数组
en: The AI's response wasn't a valid JSON array.
fr: La réponse de l'IA n'était pas un tableau JSON valide.
ja: AIの応答が有効なJSON配列ではありません

# error.ocr.noText
source: 没能从这张小票上识别出文字，请确保小票清晰、光线充足后重拍。
en: No text was found on this receipt. Please make sure it's clear and well-lit, then try again.
fr: Aucun texte n'a été détecté sur ce reçu. Assurez-vous qu'il soit net et bien éclairé, puis réessayez.
ja: このレシートから文字を認識できませんでした。鮮明で明るい状態で撮り直してください

# error.ocr.undecodable
source: 无法读取这张图片，请换一张更清晰的小票照片重试。
en: This photo couldn't be read. Please try a clearer receipt photo.
fr: Cette photo n'a pas pu être lue. Veuillez réessayer avec une photo de reçu plus nette.
ja: この画像を読み取れませんでした。もっと鮮明なレシート写真で再度お試しください

# error.ocr.visionFailed %@
source: 识别小票文字失败：%@
en: Couldn't recognize the receipt text: %@
fr: Impossible de reconnaître le texte du reçu : %@
ja: レシートの文字認識に失敗しました：%@

# error.recipeParse.aiReported %@
source: AI 报告：%@
en: AI reported: %@
fr: L'IA a signalé : %@
ja: AIからの報告：%@

# error.recipeParse.emptyIngredientList
source: 食材清单为空
en: The ingredient list is empty.
fr: La liste d'ingrédients est vide.
ja: 食材リストが空です

# error.recipeParse.emptyInstruction
source: 请填写改写要求
en: Please enter what you'd like to change.
fr: Veuillez indiquer ce que vous souhaitez modifier.
ja: 改変したい内容を入力してください

# error.recipeParse.emptyText
source: 食谱文本为空
en: The recipe text is empty.
fr: Le texte de la recette est vide.
ja: レシピのテキストが空です

# error.recipeParse.fetchFailed %@
source: 网页抓取失败：%@
en: Couldn't fetch the page: %@
fr: Impossible de récupérer la page : %@
ja: ページの取得に失敗しました：%@

# error.recipeParse.fetchStatus %lld
source: 网页抓取失败 (%lld)
en: Couldn't fetch the page (%lld)
fr: Impossible de récupérer la page (%lld)
ja: ページの取得に失敗しました (%lld)
